# 14. Напишите программу, которая принимает на вход вещественное число 
# и показывает сумму его цифр.
# Пример: 6782 -> 23, 0,56 -> 11

from this import s
from tkinter import N


# n = float(input('введите число = '))
# my_n = [n]
# sum_n = 0
# for n in my_n:
#     sum_n += n

# print(sum_n)



#16. Задайте список из n чисел последовательности (1+1/n)^n и выведите 
# на экран их сумму.
# Пример: Для n = 6: {1: 2, 2: 2,25, 3: 2,37, 4: 2,44, 5: 2,49, 6: 2,52}

# n =int(input('введите n ='))
# dictionary = {}
# for i in range(1,n+1):
#     dictionary[i]= (1+(1/i)**i)
# print(dictionary)


# 15. Напишите программу, которая принимает на вход число N и выдает
#  набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# n =int(input('введите число ='))
# list_n = []
# task_n = 1
# for i in range (1,n+1):
#     list_n.append(task_n)
#     task_n = task_n* i
# print (f'для n= {n}: произведение {list_n}')